package lessn_3;

public class Primitives {
    public static void main(String[] args) {
// size, byte:
//  1      byte (диапазон значений): -128 or 127
//  2      short (диапазон значений): -32,768 or 32,767
//  4      int (диапазон значений): −2,147,483,648 or 2,147,483,647
//  8      long (диапазон значений): -9,223,372,036,854,775,808 or 9,223,372,036,854,775,807; необходимо указывать l в конце
//  4      float (диапазон значений): -10^38 or 10^38
//  8      double (диапазон значений): -10^308 or 10^308
//  1      boolean (диапазон значений): true or false
//  2      char (диапазон значений): 0 or 65,535
    }
}
